recursos/DataXMLEjemplo.html

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:orac="http://oracle.e1.bssv.JP420000/">
    <soapenv:Header>
        <wsse:Security soapenv:mustUnderstand="1"
            xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken wsu:Id="UsernameToken-8"
                xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
                <wsse:Username>JDEDEV</wsse:Username>
                <wsse:Password
                    Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">
                    DEV2015</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soapenv:Header>
    <soapenv:Body>
        <orac:processSalesOrder>
            <!--Optional:-->
            <header>
                <!--Optional:-->
                <businessUnit>17007</businessUnit>
                <!--Optional:-->
                <company></company>
                <!--Optional:-->
                <currencyCodeTo>USD</currencyCodeTo>
                <dateOrdered>2023-05-19</dateOrdered>
                <!--Optional:-->
                <dateRequested>2023-05-19</dateRequested>
                <!--Optional:-->
                <dateScheduledPick></dateScheduledPick>
                <!--Optional:-->
                <deliverTo>
                    <!--Optional:-->
                    <entityId></entityId>
                    <!--Optional:-->
                    <entityLongId></entityLongId>
                    <!--Optional:-->
                    <entityTaxId></entityTaxId>
                </deliverTo>
                <!--Zero or more repetitions:-->
                <detail>
                    <!--Optional:-->
                    <agreementId></agreementId>
                    <!--Optional:-->
                    <agreementSupplement></agreementSupplement>
                    <!--Optional:-->
                    <businessUnit>17007</businessUnit>
                    <!--Optional:-->
                    <businessUnitDestination></businessUnitDestination>
                    <!--Optional:-->
                    <processing>
                        <!--Optional:-->
                        <actionType></actionType>
                        <!--Optional:-->
                        <useConfigurationRule></useConfigurationRule>
                    </processing>
                    <!--Optional:-->
                    <product>
                        <!--Zero or more repetitions:-->
                        <configuration>
                        </configuration>
                        <!--Optional:-->
                        <description1></description1>
                        <!--Optional:-->
                        <description2></description2>
                        <!--Optional:-->
                        <item>
                            <!--Optional:-->
                            <itemCatalog></itemCatalog>
                            <!--Optional:-->
                            <itemCustomer></itemCustomer>
                            <!--Optional:-->
                            <itemFreeForm></itemFreeForm>
                            <!--Optional:-->
                            <itemId>869030</itemId>
                            <!--Optional:-->
                            <itemProduct></itemProduct>
                        </item>
                    </product>
                    <!--Optional:-->
                    <quantityBackOrdered></quantityBackOrdered>
                    <!--Optional:-->
                    <quantityCanceled></quantityCanceled>
                    <!--Optional:-->
                    <quantityOrdered>2</quantityOrdered>
                    <!--Optional:-->
                    <quantityShippable></quantityShippable>
                    <!--Optional:-->
                    <reference></reference>
                    <!--Optional:-->
                    <relatedOrder>
                        <!--Optional:-->
                        <documentLineNumber></documentLineNumber>
                        <!--Optional:-->
                        <relatedOrderKey>
                            <!--Optional:-->
                            <documentCompany></documentCompany>
                            <!--Optional:-->
                            <documentNumber></documentNumber>
                            <!--Optional:-->
                            <documentTypeCode></documentTypeCode>
                        </relatedOrderKey>
                    </relatedOrder>
                    <!--Optional:-->
                    <shipTo>
                        <!--Optional:-->
                        <entityId>16505</entityId>
                        <!--Optional:-->
                        <entityLongId></entityLongId>
                        <!--Optional:-->
                        <entityTaxId></entityTaxId>
                    </shipTo>
                    <!--Optional:-->
                    <statusCodeLast></statusCodeLast>
                    <!--Optional:-->
                    <statusCodeNext></statusCodeNext>
                    <!--Optional:-->
                    <supplier>
                        <!--Optional:-->
                        <entityId></entityId>
                        <!--Optional:-->
                        <entityLongId></entityLongId>
                        <!--Optional:-->
                        <entityTaxId></entityTaxId>
                    </supplier>
                    <!--Optional:-->
                    <timePromisedDelivery></timePromisedDelivery>
                    <!--Optional:-->
                    <timePromisedOriginal></timePromisedOriginal>
                    <!--Optional:-->
                    <timePromisedShip></timePromisedShip>
                    <!--Optional:-->
                    <timeRequested></timeRequested>
                    <!--Optional:-->
                    <timeScheduledPick></timeScheduledPick>
                    <!--Optional:-->
                    <unitOfMeasureCodeTransaction></unitOfMeasureCodeTransaction>
                    <!--Optional:-->
                </detail>
                <!--Optional:-->
                <forwardedTo>
                    <!--Optional:-->
                    <entityId></entityId>
                    <!--Optional:-->
                    <entityLongId></entityLongId>
                    <!--Optional:-->
                    <entityTaxId></entityTaxId>
                </forwardedTo>
                <!--Optional:-->
                <holdOrderCode></holdOrderCode>
                <!--Optional:-->
                <invoicedTo>
                    <!--Optional:-->
                    <entityId></entityId>
                    <!--Optional:-->
                    <entityLongId></entityLongId>
                    <!--Optional:-->
                    <entityTaxId></entityTaxId>
                </invoicedTo>
                <!--Optional:-->
                <orderTakenBy></orderTakenBy>
                <!--Optional:-->
                <orderedBy></orderedBy>
                <!--Optional:-->
                <processing>
                    <!--Optional:-->
                    <actionType>A</actionType>
                    <!--Optional:-->
                    <processingVersion>ERP0004</processingVersion>
                </processing>
                <!--Optional:-->
                <rateExchange></rateExchange>
                <!--Optional:-->
                <soldTo>
                    <customer>
                        <!--Optional:-->
                        <entityId>11347</entityId>
                    </customer>
                </soldTo>
            </header>
        </orac:processSalesOrder>
    </soapenv:Body>
</soapenv:Envelope>