wp-admin/jdelogs.txt

<?xml version = "1.0" encoding = "UTF-8"?><env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:orac="http://oracle.e1.bssv.JP420000/">
    <env:Header><ns1:Security>
    <ns1:UsernameToken><ns1:Username>testdev</ns1:Username>
    <ns1:Password>testdev</ns1:Password>
    </ns1:UsernameToken></ns1:Security>
    </env:Header>   
    <env:Body>
    <orac:getSalesOrder>
    <header>
    <customerPO></customerPO></header>
    <agreementId>10882</agreementId>
    </orac:getSalesOrder>
    </env:Body></env:Envelope>
==============
<?xml version = "1.0" encoding = "UTF-8"?><env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:orac="http://oracle.e1.bssv.JP420000/">
    <env:Header><ns1:Security>
    <ns1:UsernameToken><ns1:Username>WPSTORES</ns1:Username>
    <ns1:Password>tracyripon</ns1:Password>
    </ns1:UsernameToken></ns1:Security>
    </env:Header>  
    <env:Body>
    <orac:getSalesOrder>
    <header>
    <customerPO></customerPO></header>
    <agreementId>10888</agreementId>
    </orac:getSalesOrder>
    </env:Body></env:Envelope>
==============
<?xml version = "1.0" encoding = "UTF-8"?><env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:orac="http://oracle.e1.bssv.JP420000/">
    <env:Header><ns1:Security>
    <ns1:UsernameToken><ns1:Username>WPSTORES</ns1:Username>
    <ns1:Password>tracyripon</ns1:Password>
    </ns1:UsernameToken></ns1:Security>
    </env:Header>  
    <env:Body>
    <orac:getSalesOrder>
    <header>
    <customerPO></customerPO></header>
    <agreementId>10888</agreementId>
    </orac:getSalesOrder>
    </env:Body></env:Envelope>
==============
<?xml version = "1.0" encoding = "UTF-8"?><env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:orac="http://oracle.e1.bssv.JP420000/">
    <env:Header><ns1:Security>
    <ns1:UsernameToken><ns1:Username>WPSTORES</ns1:Username>
    <ns1:Password>tracyripon</ns1:Password>
    </ns1:UsernameToken></ns1:Security>
    </env:Header>  
    <env:Body>
    <orac:getSalesOrder>
    <header>
    <customerPO></customerPO></header>
    <agreementId>10888</agreementId>
    </orac:getSalesOrder>
    </env:Body></env:Envelope>
==============
<?xml version = "1.0" encoding = "UTF-8"?><env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:orac="http://oracle.e1.bssv.JP420000/">
    <env:Header><ns1:Security>
    <ns1:UsernameToken><ns1:Username>GTEN</ns1:Username>
    <ns1:Password>ripon</ns1:Password>
    </ns1:UsernameToken></ns1:Security>
    </env:Header>  
    <env:Body>
    <orac:getSalesOrder>
    <header>
    <customerPO>23243422421</customerPO></header>
    <agreementId>61875</agreementId>
    </orac:getSalesOrder>
    </env:Body></env:Envelope>
==============
<?xml version = "1.0" encoding = "UTF-8"?><env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:orac="http://oracle.e1.bssv.JP420000/">
    <env:Header><ns1:Security>
    <ns1:UsernameToken><ns1:Username>GTEN</ns1:Username>
    <ns1:Password>ripon</ns1:Password>
    </ns1:UsernameToken></ns1:Security>
    </env:Header>  
    <env:Body>
    <orac:getSalesOrder>
    <header>
    <customerPO>23243422421</customerPO></header>
    <agreementId>61874</agreementId>
    </orac:getSalesOrder>
    </env:Body></env:Envelope>
==============
<?xml version = "1.0" encoding = "UTF-8"?><env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:orac="http://oracle.e1.bssv.JP420000/">
    <env:Header><ns1:Security>
    <ns1:UsernameToken><ns1:Username>GTEN</ns1:Username>
    <ns1:Password>ripon</ns1:Password>
    </ns1:UsernameToken></ns1:Security>
    </env:Header>  
    <env:Body>
    <orac:getSalesOrder>
    <header>
    <customerPO>23243422421</customerPO></header>
    <agreementId>61876</agreementId>
    </orac:getSalesOrder>
    </env:Body></env:Envelope>
==============
<?xml version = "1.0" encoding = "UTF-8"?><env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:orac="http://oracle.e1.bssv.JP420000/">
    <env:Header><ns1:Security>
    <ns1:UsernameToken><ns1:Username>WPSTORES</ns1:Username>
    <ns1:Password>tracyripon</ns1:Password>
    </ns1:UsernameToken></ns1:Security>
    </env:Header>  
    <env:Body>
    <orac:getSalesOrder>
    <header>
    <customerPO>23243422421</customerPO></header>
    <agreementId>61904</agreementId>
    </orac:getSalesOrder>
    </env:Body></env:Envelope>
==============
<?xml version = "1.0" encoding = "UTF-8"?><env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:orac="http://oracle.e1.bssv.JP420000/">
    <env:Header><ns1:Security>
    <ns1:UsernameToken><ns1:Username>WPSTORES</ns1:Username>
    <ns1:Password>tracyripon</ns1:Password>
    </ns1:UsernameToken></ns1:Security>
    </env:Header>  
    <env:Body>
    <orac:getSalesOrder>
    <header>
    <customerPO>23243422421</customerPO></header>
    <agreementId>61905</agreementId>
    </orac:getSalesOrder>
    </env:Body></env:Envelope>
==============
